# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

S = input('Введите количество журавликов S: ')
S = int(S)

if S % 6 == 0:
    P = S // 6
    C = P
    K = (P + C) * 2
    print(P, K, C)
else:
    print('Неверное S')