# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)

# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]


def is_in_mass(num_lst: list[int],
               min_num: int,
               max_num: int) -> list[int]:

    list = []
    for i in range(len(num_lst)):
        if min_num <= num_lst[i] <= max_num:
            list.append(i)
    return list


print(is_in_mass([-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0,
                  -5, -5, 7], 5, 15))
